<script setup>
import { ref, onMounted, computed } from 'vue';

const icons = ref(null);
const filter = ref(null);

const filteredIcons = computed(() => {
    if (filter.value) return icons.value.filter((icon) => icon.properties.name.indexOf(filter.value.toLowerCase()) > -1);
    else return icons.value;
});

onMounted(() => {
    fetch('/demo/data/icons.json', { headers: { 'Cache-Control': 'no-cache' } })
        .then((res) => res.json())
        .then((d) => {
            let data = d.icons.filter((value) => {
                return value.icon.tags.indexOf('deprecate') === -1;
            });
            data.sort((icon1, icon2) => {
                if (icon1.properties.name < icon2.properties.name) return -1;
                else if (icon1.properties.name > icon2.properties.name) return 1;
                else return 0;
            });

            icons.value = data;
        });
});
</script>

<template>
    <div class="card">
        <h2>联邦立法机构</h2>
        <p>
            联邦议会是星际联邦的一院制立法机构。（原初：《Amok Time》）联邦议会由来自各成员国的议员组成，并拥有制定、修改和批准联邦法律的权力。（深空九号：《Rapture》; 下一代：《Force of Nature》）
        </p>

        <p>
            联邦议会同时也掌握许多能够影响联邦军队即星际舰队的运作的权力。它有时也可作为军事法庭，偶尔发布对星际舰队的指挥令。（《星际迷航：抢救未来》; 下一代：《The Defector》）联邦议会还对联邦外交政策有一定影响力。（深空九号：《The
            Way of the Warrior》，《For the Cause》）联邦议会议事厅位于地球上北美洲西海岸城市圣弗朗西斯科。
        </p>

        <h2>联邦司法</h2>
        <p>联邦司法机构即联邦法院负责调解法律纠纷。联邦法院分为多个层级，其中联邦最高法院是其顶级机构。（深空九号：《Doctor Bashir, I
            Presume》）联邦法院有时依靠陪审团作出判决。联邦大陪审团听取嫌犯的证词是刑事侦查的一个环节，而联邦特别陪审团负责审判战犯。（深空九号：《The Ascent》，《Waltz》）除了针对公民的司法体系外，星际舰队有其内部的军事法庭。（原初：《Court
            Martial》; 下一代：《The Pegasus》; 深空九号：《For the Uniform》，《Time's Orphan》; 《星际迷航：起义》）</p>

        <h2>联邦法律</h2>
        <p>主条目：星际联邦法律</p>

        <br />

        <p>联邦的基本政治和法律原则来源于两个重要的文件：</p>

        <p>联邦宪章是星际联邦最早的成员们在2161年联邦成立时通过的。种族歧视在宪章中被严格禁止。（下一代：《The Outcast》; 深空九号：《Accession》; 进取号：《零点时刻》，《踏上征程》）</p>
        <p>联邦宪法包含了一系列普世权利，这些权利所在的条目被统称为“权利保障”。联邦宪法权利保障第七条赋予个人不必自证其罪的权利；第十二条则保障艺术家的权利。（下一代：《The Drumhead》，《The Perfect Mate》;
            航海家号：《Author, Author》）</p>
        <p>
            星际联邦宪法和联邦宪章的关系并不清楚。它们都含有关于个人权利的内容。有可能宪章的内容是加入联邦所需满足的基本要求，而宪法的内容则关系到一旦成为联邦成员就需认同的基本原则、政府结构以及公民权利（例如免于自证其罪的权利）。</p>
        <p>根据小说Crisis on Centaurus中的描述，联邦法律总是高于地方法律。</p>
        <p>其他公民权利和义务在下列法律、法案中有详细规定：</p>
        <p>1. 联邦法典中包含联邦关于法律问题的方针政策。</p>

        <p>2. 星际舰队基本指导原则为需要咨询或参考的情形提供政策和礼节的指导。</p>
        <p>3. 联邦司法总则中可以找到星际舰队军事法庭成立所需的法律基础。</p>


        <h2>评价</h2>
        <p>由于星际联邦所具有的规模和历史，它得到了来自各个层次邻国人民和政府的不同评价。</p>
        <p>23世纪的克林贡宣传联邦对其囚犯实施暴行：囚禁在死亡集中营中，并折磨他们以获取科学和军事秘密。2268年，当Mara被传送到联邦星舰进取号时，她提醒她的丈夫肯(Kang)不要忘记这些描述。詹姆斯·柯克上校说关于联邦她还需要了解很多。（原初：《Day
            of the Dove》）</p>
        <p>2269年，进取号拘禁了Cheron星上的居民Lokai。Lokai需要对四号基地上一起联邦穿梭机失窃事件负责。当柯克上校审问Lokai时，Lokai表示他听说过星舰，也知道这些星舰属于“星际舰队合众国”；柯克立即纠正了他。（原初：《Let
            That Be Your Last Battlefield》）</p>
        <p>
            2372年准备第一次深空九号战役时，夸克向盖瑞克讲述他对被迫滞留在星站上的恐惧。他说：“最坏的事儿是我不得不把一切希望都寄托在联邦上。”夸克随后给盖瑞克推荐地球产的根啤，并介绍说它是“又有气泡又油腻，却又让人高兴。就像联邦那样。”然后补充道：“但你知道最可怕的是什么吗？——如果你喝了太多这玩意儿，你真的会喜欢上它。”Garak不喜欢这种“低劣”饮料的口味，他说这种饮料实在是“阴险”；而Quark马上接过话来：“——就像联邦一样。”Garak花了一段时间才接受联邦，他问Quark是否认为联邦“能够拯救我们”，而已经接受了联邦的Quark说：“我希望它能。”（深空九号：《The
            Way of the Warrior》）</p>
        <p>在克林贡和联邦的关系破裂之前，Kurn极力反对打破条约，但这一请求被克林贡议会否决。他后来对Worf说，他之所以反对是“因为Gowron低估了联邦。他认为联邦很软弱，但他错了。这早晚会引发一场战争。”（深空九号：《Sons
            of Mogh》）</p>
        <p>
            一位马奇的领导人迈克尔·埃丁顿对本杰明·西斯科提到联邦为什么“这么关心马奇的问题”时推测说“那是因为我们离开了联邦；这件事儿你们永远也接受不了。没有谁愿意离开天堂。大家都应该想要居住在联邦。”“去你的，你们甚至希望卡达西人加入你们。你们援助他们复制机，因为你们希望这样一来终有一天他们将在联邦议会上找到他们‘应有的位置’。”埃丁顿最后说总结道：“你知道吗，有的时候你们还不如博格人。至少他们同化你之前还通知你一声。你们更吓人——你们同化别人，而他们却不知道！”（深空九号：《For
            the Cause》）</p>
        <p>自治同盟对联邦的看法并不很正面。在奥玛瑞安星云之战(Battle of the Omarion Nebula)大大削弱了黑曜石组织和Tal Shiar之后，冒充Lovok上校的变形人说“从今天开始在阿尔法象限里我们只剩下克林贡和联邦两个威胁；它们都不会威胁我们太久。”（深空九号：《The
            Die is Cast》）在自治同盟冷战时期，维庸对本杰明·西斯科说：“自治同盟已经存在了两千多年，而且还要继续存在。她会存在到你们的联邦早已化作尘土的时候。”（深空九号：《To the Death》）</p>
        <p>在卡达西加入自治同盟后，杜卡特上校建议本杰明·西斯科劝说联邦“跟随卡达西的脚步”加入自治同盟，这样就能“拯救（他那）宝贵的联邦”。他又说：“加入自治同盟可以拯救数十亿的生命，而且还可以联邦摆脱堙没在历史迷雾里的命运。”（深空九号：《By
            Inferno's Light》）</p>
        <p>在随后的自治同盟战争中，维庸认为自治同盟迟早要统治联邦。他假设战争胜利之后，“长期控制联邦不是件容易的事。可能需要大量的星舰，大规模的占领军以及时刻保持的警惕。”最后维庸个人认为“控制联邦的关键在地球。如果会发生有组织暴动，那它一定会从地球开始”。（深空九号：《Sacrifice
            of Angels》）</p>
        <p>2375年，与星际舰队的Mathew
            Dougherty准将一同工作的索纳人Ru'ato阐述了他对联邦的看法。他说联邦“太老了”，“它在过去的两年里已经被各个象限的霸权挑战——博格人、卡达西人，还有自治同盟。他们都嗅到了联邦行将就木的气味。”Ru'afo对Dougherty说他建议联邦议会无论如何也要“接受（Son'a的）提议。因为（他的）提议能给你那个宝贝联邦新的生命。”（《星际迷航：起义》）</p>
        <p>
            在2379年让·卢克·皮卡德和他的克隆人辛宗间发生了冲突。皮卡德想用自己的生命拯救他的星舰和联邦，但辛宗不同意皮卡德的要求：“我们不会再向任何人卑躬屈膝——我们不会向罗慕伦人，也不会向你那‘伟大’的联邦低头。”（《星际迷航：复仇女神》）</p>

    </div>
</template>

<style lang="scss" scoped>
.icons-list {
    i {
        color: var(--text-color-secondary);
    }
}
</style>
